_Rarzrabotki/Kazna/AccumulationRegisters/СчетаНал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>СчетаНал</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/AccumulationRegisters/СчетаНал/Ext/RecordSetModule.bsl
Процедура ВыполнитьПриход(Объект) Экспорт
	
	НоваяСтрока = ЭтотОбъект.Добавить();
	
	НоваяСтрока.Период		= Объект.Дата;
	НоваяСтрока.ВидДвижения	= ВидДвиженияНакопления.Приход;
	НоваяСтрока.Документ	= Объект.Ссылка;
	НоваяСтрока.Сумма		= Объект.СуммаДокумента;
	
	Записывать = Истина;
	
конецПроцедуры

Процедура ВыполнитьПриходДляПодчиненного(Объект) Экспорт
	
	НоваяСтрока = ЭтотОбъект.Добавить();
	
	НоваяСтрока.Период		= Объект.Дата;
	НоваяСтрока.ВидДвижения	= ВидДвиженияНакопления.Приход;
	НоваяСтрока.Документ	= Объект.СчетНаОплатуПоставщика;
	НоваяСтрока.Сумма		= Объект.СуммаДокумента;
	
	Записывать = Истина;
	
конецПроцедуры
Процедура ВыполнитьРасход(Объект) Экспорт
	
	Для Каждого Строка Из Объект.СчетаОснования Цикл
		
		НоваяСтрока = ЭтотОбъект.Добавить();
		
		НоваяСтрока.Период		= Объект.Дата;
		НоваяСтрока.ВидДвижения	= ВидДвиженияНакопления.Расход;
		НоваяСтрока.Документ	= Строка.Счет;
		НоваяСтрока.Сумма		= Строка.Счет.СуммаДокумента;
		
	КонецЦикла;
	
	Записывать = Истина;
	
КонецПроцедуры

Процедура ВыполнитьСторноОстатка(Ссылка, Дата) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СчетаНалОстатки.Документ,
	|	-СчетаНалОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.СчетаНал.Остатки(&Дата, Документ = &Документ) КАК СчетаНалОстатки"
	);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Документ", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НоваяСтрока = Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Период = Дата;
		НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
	КонецЕсли; 
	
	Записывать = Истина;
	
КонецПроцедуры
